artificial-intelligence/machine-learning-mastery/README.org
* foundations
** how-do-i-get-started
*** adjust-mindset
*** pick-a-process
*** pick-a-tool
*** practice-on-datasets
*** build-a-portfolio
** applied-machine-learning-process
*** define-your-problem
*** prepare-your-data
*** spot-check-algorithms
*** improve-results
*** present-results
** linear-algebra
*** discover-what-linear-algebra-is
*** discover-why-linear-algebra-is-important-for-machine-learning
*** dive-into-linear-algebra-topics
*** linear-algebra-in-python
*** vectors
*** matrices
*** matrix-factorization
** statistical-methods
*** discover-what-statistical-methods-are
*** discover-why-statistical-methods-are-important-for-machine-learning
*** dive-into-the-topics-of-statistical-methods
*** summary-statistics
*** resampling-methods
*** hypothesis-tests
*** estimation-statistics
* beginner
** understand-machine-learning-algorithms
*** discover-the-different-types-of-machine-learning-algorithms
*** discover-the-foundations-of-machine-learning-algorithms
*** discover-how-top-machine-learning-algorithms-work
*** linear-algorithms
*** nonlinear-algorithms
*** ensemble-algorithms
** weka-machine-learning-no-code
*** discover-the-features-of-the-weka-platform
*** discover-how-to-get-around-the-weka-platform
*** discover-how-to-deliver-results-with-weka
*** prepare-data-in-weka
*** weka-algorithm-tutorials
** python-machine-learning-scikit-learn
*** discover-python-for-machine-learning
*** discover-the-ecosystem-for-python-machine-learning
*** discover-how-to-work-through-problems-using-machine-learning-in-python
*** prepare-data-in-python
*** machine-learning-in-python
** r-machine-learning-caret
*** discover-the-r-platform-and-why-it-is-so-popular
*** discover-machine-learning-algorithms-in-r
*** discover-how-to-work-through-problems-using-machine-learning-in-r
*** data-preparation-in-r
*** applied-machine-learning-in-r
* intermediate
** code-algorithm-from-scratch-python
*** discover-the-benefits-of-coding-algorithms-from-scratch
*** discover-that-coding-algorithms-from-scratch-is-a-learning-tool-only
*** discover-how-to-code-machine-learning-algorithms-from-scratch-in-python
*** prepare-data
*** algorithm-evaluation
*** linear-algorithms
*** nonlinear-algorithms
** introduction-to-time-series-forecasting-python
*** discover-time-series-forecasting
*** discover-time-series-as-supervised-learning
*** discover-how-to-get-good-at-delivering-results-with-time-series-forecasting
*** data-preparation-tutorials
*** forecasting-tutorials
** xgboost-in-python-stochastic-gradient-boosting
*** discover-the-gradient-boosting-algorithm
*** discover-xgboost
*** discover-how-to-get-good-at-delivering-results-with-xgboost
*** xgboost-basics
*** xgboost-tuning
** deep-learning-keras
*** discover-what-deep-learning-is-all-about
*** discover-the-best-tools-and-libraries
*** discover-how-to-work-through-problems-and-deliver-results
*** background
*** convolutional-neural-networks
*** multilayer-perceptrons
*** recurrent-neural-networks
* advanced
** long-short-term-memory-lstm
*** discover-the-promise-of-lstms
*** discover-where-lstms-are-useful
*** discover-how-to-use-lstms-on-your-project
*** data-preparation-for-lstms
*** modeling-with-lstms
*** lstm-behaviour
*** lstm-for-time-series
** deep-learning-for-natural-language-processing-nlp
*** discover-what-deep-learning-for-nlp-is-all-about
*** discover-standard-datasets-for-nlp
*** discover-how-to-work-through-problems-and-deliver-results
*** bag-of-words-model
*** word-embeddings
*** language-modeling
*** photo-captioning
*** text-summarization
*** text-translation
** deep-learning-for-time-series-forecasting
*** discover-the-promise-and-limitations-of-deep-learning-for-time-series
*** discover-how-to-develop-robust-baseline-and-defensible-forecasting-models
*** discover-how-to-build-deep-learning-models-for-time-series-forecasting
*** human-activity-recognition
*** time-series-case-studies
*** forecast-electricity-usage
