artificial-intelligence/machine-learning-mastery/README.md
- [foundations](#sec-1)
  - [how-do-i-get-started](#sec-1-1)
    - [adjust-mindset](#sec-1-1-1)
    - [pick-a-process](#sec-1-1-2)
    - [pick-a-tool](#sec-1-1-3)
    - [practice-on-datasets](#sec-1-1-4)
    - [build-a-portfolio](#sec-1-1-5)
  - [applied-machine-learning-process](#sec-1-2)
    - [define-your-problem](#sec-1-2-1)
    - [prepare-your-data](#sec-1-2-2)
    - [spot-check-algorithms](#sec-1-2-3)
    - [improve-results](#sec-1-2-4)
    - [present-results](#sec-1-2-5)
  - [linear-algebra](#sec-1-3)
    - [discover-what-linear-algebra-is](#sec-1-3-1)
    - [discover-why-linear-algebra-is-important-for-machine-learning](#sec-1-3-2)
    - [dive-into-linear-algebra-topics](#sec-1-3-3)
    - [linear-algebra-in-python](#sec-1-3-4)
    - [vectors](#sec-1-3-5)
    - [matrices](#sec-1-3-6)
    - [matrix-factorization](#sec-1-3-7)
  - [statistical-methods](#sec-1-4)
    - [discover-what-statistical-methods-are](#sec-1-4-1)
    - [discover-why-statistical-methods-are-important-for-machine-learning](#sec-1-4-2)
    - [dive-into-the-topics-of-statistical-methods](#sec-1-4-3)
    - [summary-statistics](#sec-1-4-4)
    - [resampling-methods](#sec-1-4-5)
    - [hypothesis-tests](#sec-1-4-6)
    - [estimation-statistics](#sec-1-4-7)
- [beginner](#sec-2)
  - [understand-machine-learning-algorithms](#sec-2-1)
    - [discover-the-different-types-of-machine-learning-algorithms](#sec-2-1-1)
    - [discover-the-foundations-of-machine-learning-algorithms](#sec-2-1-2)
    - [discover-how-top-machine-learning-algorithms-work](#sec-2-1-3)
    - [linear-algorithms](#sec-2-1-4)
    - [nonlinear-algorithms](#sec-2-1-5)
    - [ensemble-algorithms](#sec-2-1-6)
  - [weka-machine-learning-no-code](#sec-2-2)
    - [discover-the-features-of-the-weka-platform](#sec-2-2-1)
    - [discover-how-to-get-around-the-weka-platform](#sec-2-2-2)
    - [discover-how-to-deliver-results-with-weka](#sec-2-2-3)
    - [prepare-data-in-weka](#sec-2-2-4)
    - [weka-algorithm-tutorials](#sec-2-2-5)
  - [python-machine-learning-scikit-learn](#sec-2-3)
    - [discover-python-for-machine-learning](#sec-2-3-1)
    - [discover-the-ecosystem-for-python-machine-learning](#sec-2-3-2)
    - [discover-how-to-work-through-problems-using-machine-learning-in-python](#sec-2-3-3)
    - [prepare-data-in-python](#sec-2-3-4)
    - [machine-learning-in-python](#sec-2-3-5)
  - [r-machine-learning-caret](#sec-2-4)
    - [discover-the-r-platform-and-why-it-is-so-popular](#sec-2-4-1)
    - [discover-machine-learning-algorithms-in-r](#sec-2-4-2)
    - [discover-how-to-work-through-problems-using-machine-learning-in-r](#sec-2-4-3)
    - [data-preparation-in-r](#sec-2-4-4)
    - [applied-machine-learning-in-r](#sec-2-4-5)
- [intermediate](#sec-3)
  - [code-algorithm-from-scratch-python](#sec-3-1)
    - [discover-the-benefits-of-coding-algorithms-from-scratch](#sec-3-1-1)
    - [discover-that-coding-algorithms-from-scratch-is-a-learning-tool-only](#sec-3-1-2)
    - [discover-how-to-code-machine-learning-algorithms-from-scratch-in-python](#sec-3-1-3)
    - [prepare-data](#sec-3-1-4)
    - [algorithm-evaluation](#sec-3-1-5)
    - [linear-algorithms](#sec-3-1-6)
    - [nonlinear-algorithms](#sec-3-1-7)
  - [introduction-to-time-series-forecasting-python](#sec-3-2)
    - [discover-time-series-forecasting](#sec-3-2-1)
    - [discover-time-series-as-supervised-learning](#sec-3-2-2)
    - [discover-how-to-get-good-at-delivering-results-with-time-series-forecasting](#sec-3-2-3)
    - [data-preparation-tutorials](#sec-3-2-4)
    - [forecasting-tutorials](#sec-3-2-5)
  - [xgboost-in-python-stochastic-gradient-boosting](#sec-3-3)
    - [discover-the-gradient-boosting-algorithm](#sec-3-3-1)
    - [discover-xgboost](#sec-3-3-2)
    - [discover-how-to-get-good-at-delivering-results-with-xgboost](#sec-3-3-3)
    - [xgboost-basics](#sec-3-3-4)
    - [xgboost-tuning](#sec-3-3-5)
  - [deep-learning-keras](#sec-3-4)
    - [discover-what-deep-learning-is-all-about](#sec-3-4-1)
    - [discover-the-best-tools-and-libraries](#sec-3-4-2)
    - [discover-how-to-work-through-problems-and-deliver-results](#sec-3-4-3)
    - [background](#sec-3-4-4)
    - [convolutional-neural-networks](#sec-3-4-5)
    - [multilayer-perceptrons](#sec-3-4-6)
    - [recurrent-neural-networks](#sec-3-4-7)
- [advanced](#sec-4)
  - [long-short-term-memory-lstm](#sec-4-1)
    - [discover-the-promise-of-lstms](#sec-4-1-1)
    - [discover-where-lstms-are-useful](#sec-4-1-2)
    - [discover-how-to-use-lstms-on-your-project](#sec-4-1-3)
    - [data-preparation-for-lstms](#sec-4-1-4)
    - [modeling-with-lstms](#sec-4-1-5)
    - [lstm-behaviour](#sec-4-1-6)
    - [lstm-for-time-series](#sec-4-1-7)
  - [deep-learning-for-natural-language-processing-nlp](#sec-4-2)
    - [discover-what-deep-learning-for-nlp-is-all-about](#sec-4-2-1)
    - [discover-standard-datasets-for-nlp](#sec-4-2-2)
    - [discover-how-to-work-through-problems-and-deliver-results](#sec-4-2-3)
    - [bag-of-words-model](#sec-4-2-4)
    - [word-embeddings](#sec-4-2-5)
    - [language-modeling](#sec-4-2-6)
    - [photo-captioning](#sec-4-2-7)
    - [text-summarization](#sec-4-2-8)
    - [text-translation](#sec-4-2-9)
  - [deep-learning-for-time-series-forecasting](#sec-4-3)
    - [discover-the-promise-and-limitations-of-deep-learning-for-time-series](#sec-4-3-1)
    - [discover-how-to-develop-robust-baseline-and-defensible-forecasting-models](#sec-4-3-2)
    - [discover-how-to-build-deep-learning-models-for-time-series-forecasting](#sec-4-3-3)
    - [human-activity-recognition](#sec-4-3-4)
    - [time-series-case-studies](#sec-4-3-5)
    - [forecast-electricity-usage](#sec-4-3-6)

# foundations<a id="sec-1"></a>

## how-do-i-get-started<a id="sec-1-1"></a>

### adjust-mindset<a id="sec-1-1-1"></a>

### pick-a-process<a id="sec-1-1-2"></a>

### pick-a-tool<a id="sec-1-1-3"></a>

### practice-on-datasets<a id="sec-1-1-4"></a>

### build-a-portfolio<a id="sec-1-1-5"></a>

## applied-machine-learning-process<a id="sec-1-2"></a>

### define-your-problem<a id="sec-1-2-1"></a>

### prepare-your-data<a id="sec-1-2-2"></a>

### spot-check-algorithms<a id="sec-1-2-3"></a>

### improve-results<a id="sec-1-2-4"></a>

### present-results<a id="sec-1-2-5"></a>

## linear-algebra<a id="sec-1-3"></a>

### discover-what-linear-algebra-is<a id="sec-1-3-1"></a>

### discover-why-linear-algebra-is-important-for-machine-learning<a id="sec-1-3-2"></a>

### dive-into-linear-algebra-topics<a id="sec-1-3-3"></a>

### linear-algebra-in-python<a id="sec-1-3-4"></a>

### vectors<a id="sec-1-3-5"></a>

### matrices<a id="sec-1-3-6"></a>

### matrix-factorization<a id="sec-1-3-7"></a>

## statistical-methods<a id="sec-1-4"></a>

### discover-what-statistical-methods-are<a id="sec-1-4-1"></a>

### discover-why-statistical-methods-are-important-for-machine-learning<a id="sec-1-4-2"></a>

### dive-into-the-topics-of-statistical-methods<a id="sec-1-4-3"></a>

### summary-statistics<a id="sec-1-4-4"></a>

### resampling-methods<a id="sec-1-4-5"></a>

### hypothesis-tests<a id="sec-1-4-6"></a>

### estimation-statistics<a id="sec-1-4-7"></a>

# beginner<a id="sec-2"></a>

## understand-machine-learning-algorithms<a id="sec-2-1"></a>

### discover-the-different-types-of-machine-learning-algorithms<a id="sec-2-1-1"></a>

### discover-the-foundations-of-machine-learning-algorithms<a id="sec-2-1-2"></a>

### discover-how-top-machine-learning-algorithms-work<a id="sec-2-1-3"></a>

### linear-algorithms<a id="sec-2-1-4"></a>

### nonlinear-algorithms<a id="sec-2-1-5"></a>

### ensemble-algorithms<a id="sec-2-1-6"></a>

## weka-machine-learning-no-code<a id="sec-2-2"></a>

### discover-the-features-of-the-weka-platform<a id="sec-2-2-1"></a>

### discover-how-to-get-around-the-weka-platform<a id="sec-2-2-2"></a>

### discover-how-to-deliver-results-with-weka<a id="sec-2-2-3"></a>

### prepare-data-in-weka<a id="sec-2-2-4"></a>

### weka-algorithm-tutorials<a id="sec-2-2-5"></a>

## python-machine-learning-scikit-learn<a id="sec-2-3"></a>

### discover-python-for-machine-learning<a id="sec-2-3-1"></a>

### discover-the-ecosystem-for-python-machine-learning<a id="sec-2-3-2"></a>

### discover-how-to-work-through-problems-using-machine-learning-in-python<a id="sec-2-3-3"></a>

### prepare-data-in-python<a id="sec-2-3-4"></a>

### machine-learning-in-python<a id="sec-2-3-5"></a>

## r-machine-learning-caret<a id="sec-2-4"></a>

### discover-the-r-platform-and-why-it-is-so-popular<a id="sec-2-4-1"></a>

### discover-machine-learning-algorithms-in-r<a id="sec-2-4-2"></a>

### discover-how-to-work-through-problems-using-machine-learning-in-r<a id="sec-2-4-3"></a>

### data-preparation-in-r<a id="sec-2-4-4"></a>

### applied-machine-learning-in-r<a id="sec-2-4-5"></a>

# intermediate<a id="sec-3"></a>

## code-algorithm-from-scratch-python<a id="sec-3-1"></a>

### discover-the-benefits-of-coding-algorithms-from-scratch<a id="sec-3-1-1"></a>

### discover-that-coding-algorithms-from-scratch-is-a-learning-tool-only<a id="sec-3-1-2"></a>

### discover-how-to-code-machine-learning-algorithms-from-scratch-in-python<a id="sec-3-1-3"></a>

### prepare-data<a id="sec-3-1-4"></a>

### algorithm-evaluation<a id="sec-3-1-5"></a>

### linear-algorithms<a id="sec-3-1-6"></a>

### nonlinear-algorithms<a id="sec-3-1-7"></a>

## introduction-to-time-series-forecasting-python<a id="sec-3-2"></a>

### discover-time-series-forecasting<a id="sec-3-2-1"></a>

### discover-time-series-as-supervised-learning<a id="sec-3-2-2"></a>

### discover-how-to-get-good-at-delivering-results-with-time-series-forecasting<a id="sec-3-2-3"></a>

### data-preparation-tutorials<a id="sec-3-2-4"></a>

### forecasting-tutorials<a id="sec-3-2-5"></a>

## xgboost-in-python-stochastic-gradient-boosting<a id="sec-3-3"></a>

### discover-the-gradient-boosting-algorithm<a id="sec-3-3-1"></a>

### discover-xgboost<a id="sec-3-3-2"></a>

### discover-how-to-get-good-at-delivering-results-with-xgboost<a id="sec-3-3-3"></a>

### xgboost-basics<a id="sec-3-3-4"></a>

### xgboost-tuning<a id="sec-3-3-5"></a>

## deep-learning-keras<a id="sec-3-4"></a>

### discover-what-deep-learning-is-all-about<a id="sec-3-4-1"></a>

### discover-the-best-tools-and-libraries<a id="sec-3-4-2"></a>

### discover-how-to-work-through-problems-and-deliver-results<a id="sec-3-4-3"></a>

### background<a id="sec-3-4-4"></a>

### convolutional-neural-networks<a id="sec-3-4-5"></a>

### multilayer-perceptrons<a id="sec-3-4-6"></a>

### recurrent-neural-networks<a id="sec-3-4-7"></a>

# advanced<a id="sec-4"></a>

## long-short-term-memory-lstm<a id="sec-4-1"></a>

### discover-the-promise-of-lstms<a id="sec-4-1-1"></a>

### discover-where-lstms-are-useful<a id="sec-4-1-2"></a>

### discover-how-to-use-lstms-on-your-project<a id="sec-4-1-3"></a>

### data-preparation-for-lstms<a id="sec-4-1-4"></a>

### modeling-with-lstms<a id="sec-4-1-5"></a>

### lstm-behaviour<a id="sec-4-1-6"></a>

### lstm-for-time-series<a id="sec-4-1-7"></a>

## deep-learning-for-natural-language-processing-nlp<a id="sec-4-2"></a>

### discover-what-deep-learning-for-nlp-is-all-about<a id="sec-4-2-1"></a>

### discover-standard-datasets-for-nlp<a id="sec-4-2-2"></a>

### discover-how-to-work-through-problems-and-deliver-results<a id="sec-4-2-3"></a>

### bag-of-words-model<a id="sec-4-2-4"></a>

### word-embeddings<a id="sec-4-2-5"></a>

### language-modeling<a id="sec-4-2-6"></a>

### photo-captioning<a id="sec-4-2-7"></a>

### text-summarization<a id="sec-4-2-8"></a>

### text-translation<a id="sec-4-2-9"></a>

## deep-learning-for-time-series-forecasting<a id="sec-4-3"></a>

### discover-the-promise-and-limitations-of-deep-learning-for-time-series<a id="sec-4-3-1"></a>

### discover-how-to-develop-robust-baseline-and-defensible-forecasting-models<a id="sec-4-3-2"></a>

### discover-how-to-build-deep-learning-models-for-time-series-forecasting<a id="sec-4-3-3"></a>

### human-activity-recognition<a id="sec-4-3-4"></a>

### time-series-case-studies<a id="sec-4-3-5"></a>

### forecast-electricity-usage<a id="sec-4-3-6"></a>
